app/controllers/accomodations_controller.rb

		def index
			@accomodations = Accomodation.where(destination_id: params[:destination_id])
---
SELECT "accomodations".* FROM "accomodations" WHERE "accomodations"."destination_id" = $1  [["destination_id", 1]]