app/controllers/destinations_controller.rb

	def index
		@destinations = Destination.where(trip_id: params[:trip_id])
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."trip_id" = $1  [["trip_id", 1]]