app/controllers/events_controller.rb

	def index
		@events = Event.where(destination_id: params[:destination_id])
---
SELECT "events".* FROM "events" WHERE "events"."destination_id" = $1  [["destination_id", 1]]