app/controllers/expenses_controller.rb

	def index # /trips/:trip_id/expenses
		@expenses = Trip.find(params[:trip_id]).expenses
---
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "expenses".* FROM "expenses" INNER JOIN "events" ON "expenses"."event_id" = "events"."id" INNER JOIN "destinations" ON "events"."destination_id" = "destinations"."id" WHERE "destinations"."trip_id" = $1  [["trip_id", 1]]