app/controllers/packing_lists_controller.rb

SELECT "packing_lists".* FROM "packing_lists"
---
	def index
		@packing_list = PackingList.all