app/controllers/transportations_controller.rb

	def index
		@transportation = Transportation.where(destination_id: params[:destination_id])
---
SELECT "transportations".* FROM "transportations" WHERE "transportations"."destination_id" = $1  [["destination_id", 1]]